{
  "alpha_pattern": {},
  "auto_mapping": null,
  "base_model_name_or_path": "LoftQ/Llama-2-13b-hf-4bit-64rank",
  "bias": "none",
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layers_pattern": null,
  "layers_to_transform": null,
  "loftq_config": {
    "loftq_bits": 4,
    "loftq_iter": 5
  },
  "lora_alpha": 64,
  "lora_dropout": 0.1,
  "megatron_config": null,
  "megatron_core": "megatron.core",
  "modules_to_save": null,
  "peft_type": "LORA",
  "r": 64,
  "rank_pattern": {},
  "revision": null,
  "target_modules": [
    "k_proj",
    "v_proj",
    "gate_proj",
    "up_proj",
    "q_proj",
    "down_proj",
    "o_proj"
  ],
  "task_type": "CAUSAL_LM",
  "use_rslora": false
}